In [3]:
import numpy as np
import pandas as pd

In [7]:
dict1 = {
    "name":['harry', 'rohan', 'pk', ' shubh'],
    "marks":[90,43,45,32],
    "city":['rampur', 'kolkata','barailly', 'ghazipur']
}

In [9]:
df = pd.DataFrame(dict1)

In [10]:
df

     name  marks      city
0   harry     90    rampur
1   rohan     43   kolkata
2      pk     45  barailly
3   shubh     32  ghazipur

In [11]:
df.to_csv('friends.csv')

In [12]:
df.to_csv('friends_index_false.csv', index=False)

In [13]:
df.head(2)

    name  marks     city
0  harry     90   rampur
1  rohan     43  kolkata

In [14]:
df.tail(2)

     name  marks      city
2      pk     45  barailly
3   shubh     32  ghazipur

In [15]:
df.describe()

           marks
count   4.000000
mean   52.500000
std    25.645013
min    32.000000
25%    40.250000
50%    44.000000
75%    56.250000
max    90.000000

In [17]:
pk = pd.read_csv('pk.csv')

In [18]:
pk

     name  marks      city
0   harry     90    rampur
1   rohan     43   kolkata
2      pk     45  barailly
3   shubh     32  ghazipur

In [19]:
harry['marks']

NameError: name 'harry' is not defined

In [20]:
pk['Marks']

KeyError: 'Marks'

In [21]:
pk['marks']

0    90
1    43
2    45
3    32
Name: marks, dtype: int64

In [22]:
pk['marks'][2]=50

C:\Users\pradkumar\AppData\Local\Temp\ipykernel_20028\2216190248.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pk['marks'][2]=50

In [23]:
pk['marks']

0    90
1    43
2    50
3    32
Name: marks, dtype: int64

In [24]:
pk.to_csv('pk1.csv')

In [25]:
pk.index = ['first', 'second', 'third', 'fourth']

In [26]:
pk

          name  marks      city
first    harry     90    rampur
second   rohan     43   kolkata
third       pk     50  barailly
fourth   shubh     32  ghazipur